driver-tests/bpelse/assign/AssignJbi/src/jbiServiceUnits/AssignBpel/Assign/documentMultiNS.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions 
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="documentMultiNS" targetNamespace="http://localhost/AssignBpel/documentMultiNS" xmlns:tns="http://localhost/AssignBpel/documentMultiNS" xmlns:ns="http://xml.netbeans.org/examples/EmployeeNS" xmlns:plink="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://localhost/AssignBpel/documentMultiNS" xmlns:tns="http://localhost/AssignBpel/documentMultiNS">
            <xsd:import namespace="http://xml.netbeans.org/examples/EmployeeNS" schemaLocation="schema/Employee.xsd"/>
        </xsd:schema>
    </types>
    <message name="outputMessageType">
        <part name="part" element="ns:Employee"/>
    </message>
    <message name="inputMessageType">
        <part name="part" type="xsd:string"/>
    </message>
    <portType name="myPortType">
        <operation name="operation">
            <input name="input" message="tns:inputMessageType"/>
            <output name="output" message="tns:outputMessageType"/>
        </operation>
    </portType>
    <binding name="Binding" type="tns:myPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="operation">
            <soap:operation soapAction="operation"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="myService">
        <port binding="tns:Binding" name="port">
            <soap:address location="http://localhost:${HttpDefaultPort}/documentMultiNSService"/>
        </port>
    </service>
    <plink:partnerLinkType name="documentMultiNSService">
        <plink:role name="myRole" portType="tns:myPortType"/>
    </plink:partnerLinkType>
</definitions>
