driver-tests/bpelse/assign/AssignJbi/test/copyRepeatingNodesUsingPredicate/Input.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
					xmlns:xsd="http://www.w3.org/1999/XMLSchema"
					xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
	<SOAP-ENV:Header/>
	<SOAP-ENV:Body>
			<Employee xmlns="http://xml.netbeans.org/examples/EmployeeNS">
				<ns2:person xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS">
					<ns3:EmployeeNumber xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">1234</ns3:EmployeeNumber>
					<ns3:LastName xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Doe</ns3:LastName>
					<ns3:JobTitle xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Sr Engineer</ns3:JobTitle>
					<ns3:Department xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Development</ns3:Department>
					<ns3:Supervisor xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Yes</ns3:Supervisor>
				</ns2:person>
				<ns2:home xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" country="US">
					<ns4:name xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">John Doe</ns4:name>
					<ns4:street xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">123 street</ns4:street>
					<ns4:city xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">Monrovia</ns4:city>
					<ns4:state xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">CA</ns4:state>
					<ns4:zip xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">91016</ns4:zip>
					<ns4:note xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">Note1</ns4:note>
					<ns4:note xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">Note2</ns4:note>
					<ns4:note xmlns:ns4="http://xml.netbeans.org/examples/AddressNS">Note3</ns4:note>
				</ns2:home>
			</Employee>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>