driver-tests/bpelse/assign/AssignJbi/test/results/copyRepeatingNodesUsingPredicate/Actual_20130318180027_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Employee xmlns="http://xml.netbeans.org/examples/EmployeeNS" xmlns:msgns="http://j2ee.netbeans.org/wsdl/copyRepeatingNodesUsingPredicate">
      <person xmlns:ns2="http://xml.netbeans.org/examples/EmployeeNS" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance">
					<ns3:EmployeeNumber xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">1234</ns3:EmployeeNumber>
					<ns3:LastName xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Doe</ns3:LastName>
					<ns3:JobTitle xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Sr Engineer</ns3:JobTitle>
					<ns3:Department xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Development</ns3:Department>
					<ns3:Supervisor xmlns:ns3="http://xml.netbeans.org/examples/EmployeeInfoNS">Yes</ns3:Supervisor>
				</person>
      <home>
        <ns:name xmlns:ns="http://xml.netbeans.org/examples/AddressNS">John Doe</ns:name>
        <ns:street xmlns:ns="http://xml.netbeans.org/examples/AddressNS">123 street</ns:street>
        <ns:city xmlns:ns="http://xml.netbeans.org/examples/AddressNS">Monrovia</ns:city>
        <ns:state xmlns:ns="http://xml.netbeans.org/examples/AddressNS">CA</ns:state>
        <ns:zip xmlns:ns="http://xml.netbeans.org/examples/AddressNS">91016</ns:zip>
        <ns:note xmlns:ns="http://xml.netbeans.org/examples/AddressNS">Note1</ns:note>
        <ns:note xmlns:ns="http://xml.netbeans.org/examples/AddressNS">Note2</ns:note>
        <ns:note xmlns:ns="http://xml.netbeans.org/examples/AddressNS">Note3</ns:note>
      </home>
    </Employee>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>